track_body.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/track/v18">
   <SOAP-ENV:Body>
      <TrackRequest>
<WebAuthenticationDetail>
<ParentCredential>
<Key>{parent_key}</Key>
<Password>{parent_password}</Password>
</ParentCredential>
<UserCredential>
<Key>{user_key}</Key>
<Password>{user_password}</Password>
</UserCredential>
</WebAuthenticationDetail>
<ClientDetail>
<AccountNumber>{client_account}</AccountNumber>
<MeterNumber>{client_meter}</MeterNumber>
</ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>Track By Number_v18</CustomerTransactionId>
            <Localization>
               <LanguageCode>EN</LanguageCode>
            </Localization>
         </TransactionDetail>
         <Version>
            <ServiceId>trck</ServiceId>
            <Major>18</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <SelectionDetails>
            <PackageIdentifier>
               <Type>TRACKING_NUMBER_OR_DOORTAG</Type>
               <Value>{tracking_number}</Value>
            </PackageIdentifier>
         </SelectionDetails>
         <ProcessingOptions>INCLUDE_DETAILED_SCANS</ProcessingOptions>
      </TrackRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>